<?php
/*
* Autor Andrey Lysikov (C) 2013
* icq: 454169
*/
//--------------------------------------------------------------
// Параметры соединения с базой данных, см DB Class
//--------------------------------------------------------------

##ORACLE OCI8 INTERFACE
define("DB","oci");
define("DB_USER_NAME","user");
define("DB_PASSWORD","password");
define("DB_NAME", "base cheme");
define("DB_ENCODING","CL8MSWIN1251");

//--------------------------------------------------------------
// Авторизация пользователей:
//--------------------------------------------------------------
##LDAP AUTH INTERFACE
#define("AUTH","ldap");
#define("AUTH_DOMAIN","domain.ru");
#define("AUTH_PORT","389");

## AUTH FROM DB INTERFACE
#define("AUTH","oci.db");

## TESTING LOCAL AUTCH INTERFACE
define("AUTH","local");
define("AUTH_USER_NAME","user name");

//--------------------------------------------------------------
// Параметры справки:
//--------------------------------------------------------------
define("HELP",false);
define("HELP_FOLDER","help");

//--------------------------------------------------------------
// Кодировка, базы данных, кодировка веб сервера, и ХТМЛ
//--------------------------------------------------------------
define("LOCAL_ENCODING","CP1251");
define("HTML_ENCODING","UTF-8");
define("THEMES_DIR","themes");

//--------------------------------------------------------------
// Общие параметры
//--------------------------------------------------------------
define("UPLOAD_DIR","upload_file");

//--------------------------------------------------------------
// Дебагер
//--------------------------------------------------------------
#define("HAS_DEBUG_FILE","debug.txt");
?>